{
	"300": {
	   "name": "Multiple Choices",
	   "description": "Indicates multiple options for the resource from which the client may choose (via agent-driven content negotiation). For example, this code could be used to present multiple video format options, to list files with different filename extensions, or to suggest word-sense disambiguation."
	},

	"301": {
	   "name": "Moved Permanently",
	   "description":	"This and all future requests should be directed to the given URI."
	},

	"302": {
		"name": "Found",
		"description": "Tells the client to look at (browse to) another url. 302 has been superseded by 303 and 307. This is an example of industry practice contradicting the standard. The HTTP/1.0 specification (RFC 1945) required the client to perform a temporary redirect (the original describing phrase was \"Moved Temporarily\"), but popular browsers implemented 302 with the functionality of a 303 See Other. Therefore, HTTP/1.1 added status codes 303 and 307 to distinguish between the two behaviours. However, some Web applications and frameworks use the 302 status code as if it were the 303."
	},

	"303": {
		"name": "See Other",
		"description": "The response to the request can be found under another URI using the GET method. When received in response to a POST (or PUT/DELETE), the client should presume that the server has received the data and should issue a new GET request to the given URI."
	},

	"304": {
		"name": "Not Modified",
	   	"description": "Indicates that the resource has not been modified since the version specified by the request headers If-Modified-Since or If-None-Match. In such case, there is no need to retransmit the resource since the client still has a previously-downloaded copy."
	},

	"305": {
		"name": "Use Proxy",
		"description": "The requested resource is available only through a proxy, the address for which is provided in the response. Many HTTP clients (such as Mozilla and Internet Explorer) do not correctly handle responses with this status code, primarily for security reasons."
	},

	"306": {
		"name": "Switch Proxy",
		"description": "No longer used. Originally meant \"Subsequent requests should use the specified proxy.\""
	},

	"307": {
		"name": "Temporary Redirect",
		"description": "In this case, the request should be repeated with another URI; however, future requests should still use the original URI. In contrast to how 302 was historically implemented, the request method is not allowed to be changed when reissuing the original request. For example, a POST request should be repeated using another POST request."
	},

	"308": {
		"name": "Permanent Redirect",
		"description": "The request and all future requests should be repeated using another URI. 307 and 308 parallel the behaviors of 302 and 301, but do not allow the HTTP method to change. So, for example, submitting a form to a permanently redirected resource may continue smoothly."
	}
}
